app/controllers/microposts_controller.rb

def create
  @micropost = current_user.microposts.build(micropost_params)
  if @micropost.save
---
INSERT INTO `microposts` (`content`, `user_id`, `created_at`, `updated_at`) VALUES ('hello', 1, '2019-10-31 02:24:37', '2019-10-31 02:24:37')