app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `password_digest`) VALUES ('Yuichiro Ikeda', 'yibk18@gmail.com', '2019-10-30 01:42:28', '2019-10-30 01:42:28', '$2a$12$GiiDqqZJoszQEFtqDuA3vuJYdE.R9xZPM98h4sT4PvXeRAXtGFuzO')
---
  def create
    @user=User.new(user_params)
    if @user.save

SELECT  `users`.* FROM `users` LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `users`
---
  def index
    @users = User.paginate(page: params[:page],per_page: 10)